Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Note: The "variadic" parameter can only appear at the end of the formal parameter list.
ja: 注：「可変型」パラメータは、フォーマルパラメータリストの最後にのみ出現することができます。

source: Note: The KeyHistory function/menu-item shows how many threads are in an interrupted state and the ListHotkeys function/menu-item shows which hotkeys have threads.
ja: 注： KeyHistory関数/メニュー項目は、中断状態にあるスレッドの数を示し、ListHotkeys関数/メニュー項目は、どのホットキーにスレッドがあるかを示します。

source: Note: The OnOff and SendMouse modes might have no effect if UAC is enabled or the script has not been run as administrator.
ja: 注：UACが有効になっていたり、スクリプトが管理者として実行されていない場合、OnOffと SendMouseモードは効果がない場合があります。

source: Note: The result of the sub-expression Expr must be the name or partial name of the variable or property to be accessed.
ja: 注：部分式Exprの 結果は、アクセスする変数またはプロパティの名前または部分名でなければならない。

source: Note: The HotIf function uses the string that you pass to it, not the original source code.
ja: 注意：HotIf関数は、元のソースコードではなく、渡した文字列を使用します。

source: Note: The characters Ctrl+A through Ctrl+Z correspond to Chr(1) through Chr(26).
ja: 注意：Ctrl+AからCtrl+Zは、Chr(1) から Chr(26)に対応しています。

source: Note: The condition cannot begin with ! or any other expression operator, as it would be interpreted as a continuation line.
ja: 注：条件は、継続行と解釈されるため、!やその他の式演算子で始めることはできません。

source: Note: The last character before :: is never interpreted as a modifier symbol.
ja: 注：::の前の最後の文字は、修飾記号として解釈されることはありません。

source: Note: The names of the letter and number keys are the same as that single letter or digit.
ja: 注：文字と数字のキーの名前は、その1文字または数字と同じです。

source: Note: The properties window will automatically close when the script terminates.
ja: 注： プロパティウィンドウはスクリプトが終了すると自動的に閉じます。

source: Note: The standard error dialog requires Message, Extra, File and Line to be own value properties.
ja: 注：標準エラーダイアログでは、Message、Extra、File、Lineが 独自の値プロパティであることが必要です。

source: Note: There are exceptions, but those tend to cause confusion a lot of the time.
ja: 注：例外もありますが、それは多くの場合混乱を招きがちです。

source: Note: There are several different forms of Send.
ja: 注：Sendにはいくつかの種類があります。

source: Note: There are some decimal fractions which the binary floating-point format cannot precisely represent, so a number is rounded to the closest representable number.
ja: 注：2進浮動小数点形式では正確に表現できない10進数の端数があるため、表現可能な最も近い数値に丸められます。

source: Note: There must not be any space between the function and open parenthesis.
ja: 注：関数と開いた括弧の間には、スペースを入れてはいけません。

source: Note: This answer applies only to the AutoHotkey v1 installer.
ja: 注：この回答はAutoHotkey v1インストーラーにのみ適用されます。

source: Note: This example assumes AutoHotkey is installed in the default location, and will show an error otherwise.
ja: 注：この例では、AutoHotkeyがデフォルトの場所にインストールされていることを前提としていて、そうでないときはエラーが表示されます。

source: Note: This might result in the last line ending in a naked carriage return (`r) rather than `r`n.
ja: 注意：その結果、最終行の末尾が `r`n ではなく、裸のキャリッジリターン（`r）になってしまうかもしれません。

source: Note: This parameter is not an expression, but can be enclosed in quote marks (either 'single' or "double").
ja: 注：このパラメータは式ではなく、引用符（「シングル」または「ダブル」のいずれか）で囲むことができます。

source: Note: This section builds on topics covered in other parts of the documentation:
ja: 注：このセクションは、ドキュメントの他の部分でカバーされているトピックを構築しています。

source: Note: This section builds on topics covered in other parts of the documentation: Strings, String Encoding.
ja: 注：このセクションは、ドキュメントの他の部分でカバーされているトピックを構築しています：文字列、文字列のエンコード。

source: Note: This sub-function should be used sparingly because most scripts perform more consistently with settings close to the defaults.
ja: 注：ほとんどのスクリプトはデフォルトに近い設定の方が安定して動作するため、このサブファンクションは控えめに使用してください。

source: Note: This tutorial is for AutoHotkey v2.
ja: 注：このチュートリアルはAutoHotkey v2用です。

source: Note: This variable will be blank if the file does not have a short name, which can happen on systems where NtfsDisable8dot3NameCreation has been set in the registry.
ja: 注意：NtfsDisable8dot3NameCreationがレジストリに設定されているシステムで起こりうることですが、ファイルに短い名前がない場合、この変数は空白となります。

source: Note: To convert a radians value to degrees, multiply it by 180/pi (approximately 57.29578).
ja: 注意：ラジアンの値を度数に変換するには、180/pi（約57.29578）を掛けます。

source: Note: To pass a NULL handle or pointer, pass the integer 0.
ja: 注意：NULLハンドルまたはポインタを渡す場合は、整数0を渡します。

source: Note: To retrieve a formatted time or date appropriate for your locale and language, use FormatTime() (time and long date) or FormatTime(, "LongDate") (retrieves long-format date).
ja: 注：ロケールや言語に適した書式の時刻や日付を取得するには、FormatTime()（時刻と長い日付）あるいはFormatTime(, "LongDate")（長い書式の日付を取得）を使用します。

source: Note: To retrieve text from a ListView, ListBox, or ComboBox, use ListViewGetContent or ControlGetItems instead.
ja: 注：ListView、ListBox、またはComboBoxからテキストを取得するには、代わりにListViewGetContentまたはControlGetItemsを使用します。

source: Note: Unlike if statements, braces have no effect with the #HotIf directive.
ja: 注： if文とは異なり、中括弧は#HotIf指示文では効果がありません。

source: Note: Unlike Ctrl/Alt/Shift, there is no generic/neutral "Win" key because the OS does not support it.
ja: 注：Ctrl/Alt/Shiftとは異なり、OSがサポートしていないため、汎用的、中立的な「Win」キーは存在しません。

source: Note: Use of #HotIf in an unresponsive script may cause input lag or break hotkeys (see below).
ja: 注：無反応のスクリプトで#HotIfを使用すると、入力ラグが発生したり、ホットキーが壊れたりすることがあります（下記参照）。

source: Note: When Encoding is specified, Length should be the size of the buffer (in characters), not the length of String or a substring, as conversion may increase its length.
ja: 注意： Encodingが指定されている場合、Lengthはバッファのサイズ（文字数）であるべきで、Stringや部分文字列の長さではないはずです。

source: Note: When an explicit property name is combined with empty brackets, as in obj.prop[], it is handled as two separate operations:
ja: 注： obj.prop[]のように明示的なプロパティ名が空括弧と組み合わされているときは、それは2つの別々の操作として扱われます：

source: Note: When an explicit property name is combined with empty brackets, as in obj.prop[], it is handled as two separate operations: first retrieve obj.prop, then invoke the default property of the result.
ja: 注： obj.prop[]のように明示的なプロパティ名が空括弧と組み合わされているときは、それは2つの別々の操作として扱われます：まずobj.propを取得し、次に結果のデフォルト・プロパティを呼び出します。

source: Note: When passing a string to a function, be aware what type of string the function expects.
ja: 注意：関数に文字列を渡すときは、その関数がどの型の文字列を期待しているかを意識してください。

source: Note: When used at the beginning of a line, the ternary condition should usually be enclosed in parentheses to reduce ambiguity with other types of statements.
ja: 注：行頭で使用する場合、他の文との曖昧さを避けるため、3項条件は通常括弧で囲む。

source: Note: While compressing the script executable prevents casual inspection of the script's source code using a plain text editor like Notepad or a PE resource editor, it does not prevent the source code from being extracted by tools dedicated to that purpose.
ja: 注：スクリプトの実行ファイルを圧縮すると、メモ帳のようなプレーンテキストエディタやPEリソースエディタを使って、スクリプトのソースコードを気軽に閲覧することができなくなりますが、そのような目的に特化したツールによってソースコードが抽出されることは防げません。

source: Note: Windows IME may interfere with the detection and functionality of CapsLock; see CapsLock and IME for details.
ja: 注：Windows IME は、CapsLock の検出と機能に干渉する場合があります。詳細については、CapsLockとIME を参照してください。

source: Note: Within this section, an object is any instance of the Object class.
ja: 注：このセクションでは、オブジェクトとは Objectクラスのインスタンスを指します。

source: Note:
ja: 注意：

source: Null-termination: Each string is terminated with a "null character", or in other words, a character with ordinal value of zero marks the end of the string.
ja: ヌル文字の終端：各文字列は「ヌル文字」で終端されます。言い換えれば、序列値がゼロの文字が文字列の終わりを示します。

source: NumLock, CapsLock, and ScrollLock: These keys may be forced to be "AlwaysOn" or "AlwaysOff".
ja: NumLock、CapsLock、ScrollLock：これらのキーは、強制的に「AlwaysOn」または「AlwaysOff」にすることができます。

source: Numeric strings: A string of digits (or any other supported number format) is automatically interpreted as a number when a math operation or comparison requires it.
ja: 数値の文字列：数値文字列：数字（またはその他のサポートされている数値フォーマット）の文字列は、数学演算や比較で必要とされる場合、自動的に数値として解釈されます。

source: O: Omit the ending character of auto-replace hotstrings when the replacement is produced.
ja: O：自動置換されたホットストリングの末尾文字を、置換が行われる際に省略します。

source: OSError: An internal function call to a Win32 function failed.
ja: OSError：Win32関数への内部関数呼び出しに失敗しました。

source: Object literal.
ja: オブジェクト・リテラル。

source: Object: An object of any type with a Hwnd property, such as a GuiControl.
ja: Object：GuiControlなど、Hwndプロパティを持つ任意の型のオブジェクト。

source: Object is the basic class from which other AutoHotkey object classes derive.
ja: Objectは、他のAutoHotkeyのオブジェクトクラスが派生する基本クラスです。

source: Off: Allows multiple instances of the script to run concurrently.
ja: Off：スクリプトの複数のインスタンスの同時実行を許可します。

source: Off: Disable warnings of the given WarningType.
ja: Off：与えられたWarningTypeの警告を無効化します。

source: Off: Disables the hotkey if it is currently enabled.
ja: Off：ホットキーが現在有効になっている場合は、無効にします。

source: Off: The current thread immediately becomes interruptible, regardless of the settings of Thread Interrupt.
ja: Off：Thread Interruptの設定に関係なく、現在のスレッドは直ちに割り込み可能な状態になります。

source: Off: The hotkey becomes disabled.
ja: Off：ホットキーが無効になります。

source: Off or 0 (false):
ja: Off または 0 （false）：

source: Off or 0 (false): Turns off the key and removes the AlwaysOn/Off attribute of the key (if present).
ja: Off または 0 (false)：キーをオフにし、キーの AlwaysOn/Off 属性を削除します（存在する場合）。

source: Off or 0 (false): Input is re-enabled.
ja: Off または 0 (false)：入力が再有効化されます。

source: Off or 0 (false): Disables the hotstring.
ja: Off または 0 (false)：ホットストリングを無効化します。

source: Off or 0 (false): The comparison is not case-sensitive, i.e. the letters A-Z are considered identical to their lowercase counterparts.
ja: Off または 0 (false)：大文字と小文字を区別して比較しません。つまり、AからZまでの文字は、その小文字と同じものとみなされます。

source: Off or 0 (false): The search is not case-sensitive, i.e. the letters A-Z are considered identical to their lowercase counterparts.
ja: Off または 0 (false)：検索では大文字と小文字が区別されないため、A-Z の文字は小文字の文字と同一と見なされます。

source: Older, less reliable method: The technique in the following example will work with MS Internet Explorer for most pages.
ja: 古く、信頼性の低い方法：以下の例の手法は、ほとんどのページでMS Internet Explorerで動作します。

source: Omitted: A few functions are able to operate on either a control or a top-level window.
ja: 省略：いくつかの機能は、コントロールとトップレベルウィンドウのどちらに対しても操作することができます。

source: On: Enables the hotkey if it is currently disabled.
ja: On：ホットキーが現在無効になっている場合は、有効にします。

source: On: The current thread is made critical, meaning that it cannot be interrupted by another thread.
ja: On：現在のスレッドは、他のスレッドによって中断されないことを意味するクリティカルにされます。

source: On: The hotkey becomes enabled.
ja: On：ホットキーが有効になります。

source: On or 1 (true):
ja: Onまたは1（true）：

source: On or 1 (true): Turns on the key and removes the AlwaysOn/Off attribute of the key (if present).
ja: On または 1 (true)：キーをオンにし、キーのAlwaysOn/Off属性（存在する場合）を削除します。

source: On or 1 (true): The user is prevented from interacting with the computer (mouse and keyboard input has no effect).
ja: On または 1 (true)：ユーザーがコンピューターと対話することができない（マウスやキーボードの入力が効果を発揮しない）状態です。

source: On or 1 (true): Each comparison is case-sensitive.
ja: On または 1 (true)：各比較は大文字と小文字を区別する。

source: On or 1 (true): Enables the hotstring.
ja: On または 1 (true)：ホットストリングを有効にします。

source: On or 1 (true): Key lookups are case-sensitive.
ja: On または 1 (true)：キーのルックアップは大文字と小文字を区別します。

source: On or 1 (true): The comparison is case-sensitive.
ja: On または 1 (true)：大文字と小文字を区別して比較します。

source: On or 1 (true): The search is case-sensitive.
ja: On または 1 (true)：検索では大文字と小文字が区別されます。

source: One True Brace (OTB, K&R style): The OTB style may optionally be used in the following places:
ja: ワン・トゥルー・ブレース（OTB、K&Rスタイル）：OTBスタイルは、以下の場所でオプションとして使用することができます。

source: One True Brace (OTB, K&R style): The OTB style may optionally be used in the following places: function definitions, If, Else, Loop, While, For, Try, Catch, and Finally.
ja: One True Brace（OTB、K&Rスタイル）：OTBスタイルは、以下の場所でオプションとして使用することができます：関数定義、If、Else、Loop、While、For、Try、Catch、Finally。

source: Options: The end of line (EOL) translation mode and output file encoding depend on which options are passed in the opening call to FileAppend (i.e. the first call which omits Filename).
ja: Options：行末（EOL）変換モードと出力ファイルのエンコーディングは、FileAppendのオープニングコール（Filenameを省略した最初のコール）でどのオプションが渡されるかに依存します。

source: Or maybe, otherwise known as the coalescing operator.
ja: あるいは、合体演算子と呼ばれるものかもしれない。

source: Other examples: Other working examples which can be downloaded and examined, are available from here.
ja: その他の例：ダウンロードして調べることができる他の実例は、ここから入手できる。

source: Other remarks: A temporary timer might often be disabled by its own function (see examples at the bottom of this page).
ja: その他の備考：一時的なタイマーは、それ自体の機能で無効になることが多いかもしれません（このページの下の方にある例を参照してください）。

source: Other uses: If the + or - symbol is not preceded by a value (or a sub-expression which yields a value), it is interpreted as a unary operator instead.
ja: その他の使用法：記号の前に値（または値を返す部分式）がない場合、代わりに単項演算子として解釈されます。

source: Other uses: If there is no space or tab to the right of a period (dot), it is interpreted as either a literal floating-point number or member access.
ja: その他の使い方：ピリオド（ドット）の右にスペースまたはタブがない場合、リテラル浮動小数点数またはメンバアクセスとして解釈される。

source: Other uses: The asterisk (*) symbol is also used in variadic function calls.
ja: その他の使用法：アスタリスク(*)記号は変種関数呼び出しにも使われる。

source: Other: The suggestions above cover the most common problems.
ja: その他：上記の提案は、最も一般的な問題をカバーしています。

source: OutputDebug: Send a description of the warning to the debugger for display.
ja: OutputDebug：警告の説明をデバッガに送信して表示させる。

source: Overriding Explorer's hotkeys: Windows' built-in hotkeys such as Win+E (#e) and Win+R (#r) can be individually overridden simply by assigning them to an action in the script.
ja: エクスプローラーのホットキーのオーバーライド： Win+E（#e）、Win+R（#r）などのWindowsの内蔵ホットキーは、スクリプト内のアクションに割り当てるだけで、個別にオーバーライドすることができます。

source: OwnDialogs: MyGui.Opt("+OwnDialogs") should be specified in each thread (such as a event handling function of a Button control) for which subsequently displayed MsgBox, InputBox, FileSelect, and DirSelect dialogs should be owned by the window.
ja: OwnDialogs：MyGui.Opt("+OwnDialogs")は、その後に表示されるMsgBox、InputBox、FileSelect、DirSelectダイアログをウィンドウで所有するための各スレッド（ボタンコントロールのイベント処理関数など）で指定する必要があります。

source: Owner: To specify an owner window for the message box, use the word Owner followed immediately by a HWND (window ID).
ja: Owner：メッセージボックスのオーナーウィンドウを指定するには、Ownerという単語の直後にHWND（ウィンドウID）を使用します。

source: P: Retrieve the physical state (i.e. whether the user is physically holding it down).
ja: P：物理的な状態（ユーザーが物理的に押さえているかどうか）を取得します。

source: Pn: Sorts items based on character position n (do not use hexadecimal for n).
ja: Pn：文字位置nに基づいて項目をソートする（nには 16 進数を使用しない）。

source: Pn: Specify the letter P followed by the hotkey's thread priority.
ja: Pn：文字Pの後にホットキーのスレッド優先順位を指定します。

source: PID: The Process ID, which is a number that uniquely identifies one specific process (this number is valid only during the lifetime of that process).
ja: PID：プロセスID。これは、ある特定のプロセスを一意に識別するための番号です。（この番号は、そのプロセスが生きている間だけ有効です）。

source: Parent: Use +Parent immediately followed by the HWND of any window or control to use it as the parent of this window.
ja: Parent：ウィンドウやコントロールのHWNDに続けて +Parentを使用すると、そのウィンドウの親として使用することができます。

source: Password: Hides the user's input (such as for password entry) by substituting masking characters for what the user types.
ja: Password：ユーザーが入力した文字にマスキング文字を代入することで、パスワードを入力するときのようにユーザーの入力を隠します。

source: Password: Mask the user's input.
ja: Password:ユーザーの入力をマスクします。

source: Performance: The comma operator is usually faster than writing separate expressions, especially when assigning one variable to another (e.g. x:=y, a:=b).
ja: パフォーマンス：カンマ演算子は、特にある変数を別の変数に代入する場合（例：x:=y、a:=b）、通常、別々の式を書くよりも速い。

source: Philip Hazel: For Perl-Compatible Regular Expressions (PCRE).
ja: Philip Hazel：Perl互換正規表現（PCRE）のために。

source: Philippe Lhoste (PhiLho): For tireless moderation and support in the forum, RegEx advice and testing, syntax and design ideas, and many other things.
ja: Philippe Lhoste (PhiLho)：フォーラムでのたゆまぬモデレーションとサポート、RegExのアドバイスとテスト、構文とデザインのアイデア、その他いろいろ。

source: Pixel: Affects PixelGetColor, PixelSearch, and ImageSearch.
ja: Pixel：PixelGetColor、PixelSearch、ImageSearchに影響します。

source: Pn: The priority of the hotstring (e.g. P1).
ja: Pn：ホットストリングの優先順位（例：P1）。

source: Polygon: When the W and H options are absent, the new display area will be a polygon determined by multiple pairs of X-Y coordinates (each pair of coordinates is a point inside the window relative to its upper left corner).
ja: 多角形： Wと Hのオプションがない場合、新しい表示領域は、複数のX-Y座標のペアによって決定される多角形になります（各座標のペアは、ウィンドウの左上隅からの相対的なウィンドウ内の点です）。

source: Pos: Specify the word Pos anywhere in Options to unconditionally use the X/Y positioning mode as described in the Control-or-Pos parameter above.
ja: Pos：Posという単語をOptionsのどこかに指定すると、上記のControl-or-Posパラメータで説明したX/Yポジショニングモードを無条件に使用することができます。

source: Power.
ja: 冪。

source: Pre- and post-increment/decrement.
ja: 増減の前後。

source: Process list: Although there is no ProcessList function, example #1 and example #2 demonstrate how to retrieve a list of processes via DllCall or COM.
ja: プロセスリスト：ProcessList関数はありませんが、例1、例2は DllCallやCOMでプロセスのリストを取得する方法を示しています。

source: Process list:
ja: プロセスリスト：

source: Prompt: Displays a dialog box asking whether to keep the old instance or replace it with the new one.
ja: Prompt：古いインスタンスを維持するか、新しいインスタンスに置き換えるかを尋ねるダイアログボックスを表示します。

source: Proxies: If a proxy server has been configured in Microsoft Internet Explorer's settings, it will be used.
ja: プロキシ：Microsoft Internet Explorerの設定でプロキシサーバーが設定されている場合は、そのサーバーを使用します。

source: Proxies:
ja: プロキシ：

source: Q: Text rendering quality.
ja: Q：テキスト描画の品質。

source: R: Rename the directory rather than moving it.
ja: R：ディレクトリを移動するのではなく、名前を変更します。

source: R: Reverse.
ja: R： リバース。

source: R: Rows of height (upon creation).
ja: R：高さの列（作成時）。

source: R: Send the replacement text raw; that is, without translating {Enter} to Enter, ^c to Ctrl+C, etc.
ja: R：つまり、{Enter}をEnterに、^cをCtrl+Cなどに変換せずに、生のまま置換テキストを送信します。

source: R: Sorts in reverse order (alphabetically or numerically depending on the other options).
ja: R：逆順に並べ替える（アルファベット順か数字順かは他のオプションによる）。

source: R: The X and Y coordinates will be treated as offsets from the current mouse position.
ja: R：X、Y座標は、現在のマウス位置からのオフセットとして扱われます。

source: R: The X1 and Y1 coordinates will be treated as offsets from the current mouse position.
ja: R：X1、Y1座標は、現在のマウス位置からのオフセットとして扱われます。

source: R: The newest non-member window (the one most recently active) is activated, but only if a member of the group is active when the function is given.
ja: R：最も新しい非メンバーウィンドウ（最も最近アクティブになったウィンドウ）がアクティブになりますが、この関数が与えられたときにグループのメンバーがアクティブである場合に限られます。

source: R: The newest window (the one most recently active) is activated, but only if no members of the group are active when the function is given.
ja: R：最も新しいウィンドウ（直近でアクティブになったウィンドウ）をアクティブにします。ただし、この関数が与えられたときにグループのどのメンバーもアクティブになっていないときだけです。

source: Rw-h: Makes the region a rectangle with rounded corners.
ja: Rw-h：領域を角を丸めた長方形にする。

source: RAW: Specify the word RAW (case-insensitive) to read the file's content as raw binary data and return a Buffer object instead of a string.
ja: RAW：RAW（大文字と小文字を区別しない）を指定すると、ファイルの内容を生のバイナリデータとして読み込み、文字列の代わりにBufferオブジェクトを返します。

source: RAW: Specify the word RAW (case-insensitive) to write the exact bytes contained by Text to the file as-is, without any conversion.
ja: RAW：RAW（大文字・小文字を区別しない）を指定すると、Textに含まれる正確なバイトを、変換せずにそのままファイルに書き込むことができます。

source: RTrim0 (RTrim followed by a zero):
ja: RTrim0（RTrimの後に0が続く）：

source: RTrim0 (RTrim followed by a zero): Turns off the omission of spaces and tabs from the end of each line.
ja: RTrim0（RTrimの後に0が続く）：行末のスペースとタブの省略をオフにする。

source: R[w-h]: Makes the region a rectangle with rounded corners.
ja: R[w-h]：領域を角を丸めた長方形にする。

source: Radio: If the item is checked, a bullet point is used instead of a check mark.
ja: Radio：項目にチェックが入っている場合は、チェックマークの代わりに箇条書きを使用します。

source: Rajat: For creating stylish replacements for the original AHK icons; a great product logo; making the syntax customizations for TextPad; discovering some bugs with the registry commands and AutoIt v2 compatibility; making SmartGUI Creator; and many other things.
ja: Rajat：オリジナルAHKアイコンのスタイリッシュな置き換え、素晴らしい製品ロゴ、TextPadの構文カスタマイズ、レジストリコマンドとAutoIt v2互換性のバグの発見、SmartGUI Creatorの作成、その他いろいろ。

source: Random: Sorts in random order.
ja: Random：ランダムな順序でソートする。

source: ReadOnly: Specify -ReadOnly (minus ReadOnly) to allow editing of the text in the first column of each row.
ja: ReadOnly：を指定します。各行の1列目のテキストの編集を許可する場合は、-ReadOnly（マイナスリードオンリー）を指定します。

source: ReadOnly: Specify -ReadOnly (minus ReadOnly) to allow editing of the text/name of each item.
ja: ReadOnly： -ReadOnly（読み取り専用）を指定すると、各項目のテキストや名前の編集を許可する。

source: Receiving parameters by address: If the & option is used, the function receives the address of the first callback parameter.
ja: アドレスでパラメータを受信：もし&オプションが使用された場合、関数は最初のコールバックパラメータのアドレスを受け取ります。

source: Recommend Fonts are highlighted in yellow. Note that fonts recommended here are fonts which are readable and have been included since Windows Vista or earlier.
ja: 推奨フォントは黄色でハイライトされています。ここで推奨されるフォントは、Windows Vista以前から含まれている可読性の高いフォントです。

source: Recommend Fonts are highlighted in yellow. Note that fonts recommended here are fonts which are readable and have been introduced with Windows Vista or earlier.
ja: 推奨フォントは黄色で強調されています。ここで推奨されるフォントは、Windows Vista以前に導入された可読性の高いフォントであることに注意してください。

source: Recommended: Run with UI access.
ja: 推奨：UIアクセスで実行します。

source: Rectangle or ellipse: If the W and H options are present, the new display area will be a rectangle whose upper left corner is specified by the first (and only) pair of X-Y coordinates.
ja: 矩形または楕円： Wと Hのオプションがある場合、新しい表示領域は、最初の（そして唯一の）X-Y座標の組で指定された左上隅を持つ矩形になります。

source: Redraw: When used with GuiCtrl.Opt, this option enables or disables redraw (visual updates) for a control by sending it a WM_SETREDRAW message.
ja: Redraw：GuiCtrl.Optと併用することで、WM_SETREDRAWメッセージを送信してコントロールの再描画（ビジュアルアップデート）を有効または無効にすることができます。

source: Reference (&): Creates a VarRef, which is a value representing a reference to a variable.
ja: 参照（&）：変数への参照を表す値である VarRef を作成します。

source: Related: #HotIf, Expressions, WinActive
ja: 関連：#HotIf、Expressions、WinActive

source: Related: Custom Combinations
ja: 関連： カスタムコンビネーション

source: Related: Functions (all about defining functions)
ja: 関連： 関数（関数の定義についてのすべて）

source: Related: Hotkey Modifier Symbols, List of Keys
ja: 関連：ホットキー修飾記号、キーのリスト

source: Related: Script Startup (the Auto-execute Thread)
ja: 関連： スクリプトの起動（自動実行のスレッド）

source: Related: ahk_class
ja: 関連：ahk_class

source: Related: ahk_exe
ja: 関連：ahk_exe

source: Related: ahk_id
ja: 関連：ahk_id

source: Related: ahk_pid
ja: 関連する ahk_pid

source: Related: Regular expressions are supported by RegExMatch, RegExReplace, and SetTitleMatchMode.
ja: 関連：正規表現はRegExMatch、RegExReplace、SetTitleMatchModeでサポートされています。

source: Related: The Thread function sets the priority or interruptibility of threads.
ja: 関連 Thread関数は、スレッドの優先度や割り込み可能性を設定する。

source: Relative: The word Rel or Relative treats the specified X and Y coordinates as offsets from the current mouse position.
ja: Relative（相対）：RelまたはRelativeという単語は、指定されたXおよびY座標を現在のマウス位置からのオフセットとして扱います。

source: Reliability: A timer might not be able to run at the expected time under the following conditions:
ja: 信頼性：以下のような条件下では、タイマーが期待通りの時刻に作動しないことがあります：

source: Report: Switches back to report view, which is the initial default.
ja: Report：初期設定のレポートビューに切り替わります。

source: Reserved words: as, and, contains, false, in, is, IsSet, not, or, super, true, unset.
ja: 予約語： as、and、contains、false、in、is、IsSet、not、or、super、true、unset。

source: Reserved words: Declaration keywords and names of control flow statements cannot be used as variable, function or class names.
ja: 予約語：宣言キーワードや制御フロー文の名前は、変数名、関数名、クラス名として使用することはできません。
